title: 学习nodejs的一些小的知识积累
date: 2015-05-09 11:40:32
categories: 技术
tags: nodejs
---
创建新的nodejs的web项目现在最新的express是4.0的版本，与先前的版本不同，这个版本开始不在app.js设置启动web应用的端口和一些异常处理，改到了../bin/www这个脚本里设置启动的路径，以及设置请求的路由设置也会在相应的目录下生成。目前作者我在学习JS，所以只是大体的写了一些东西，标志一下心得nodejs的启动方式和现在的路径对应的讲解。
<!-- more -->
首先要讲解一下nodejs的生成方式：express -e blogs //小编我呢比较喜欢ejs这个编写方式，因为很简单，一下都是这种方式编写的。
接下来会生成一个文件夹:blogs, cd blogs,显示一下目录下有:
app.js --------- 一个用于编写模块的文件，里面定义了一些会用到的东西
router ------ 配置请求路由表的文件夹，下面会有两个文件 index.js和user.js （之后可以添加一些文件请求）
public ----- 存放着你需要的样式和一些js文件，当然还有字体、图片、音乐。。。。
views  ------- 这个就是你的页面存在的文件夹了（这里就发挥你对页面的想象力吧。）
package.json ----- 这个很重要的哦，用于配置你的网页的模块依赖，和部署的一些启动方式什么的。
bin ----- 熟悉linux的都知道了，这是启动用的，这个不例外，也是启动用的。
```js

```
